---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.BarsTooCloseNumber
source: html/002e7b26-815c-a9e8-e625-3be04e12589d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.BarsTooCloseNumber Property

Bars are too close together. Decrease the Number Of Lines parameter.

## Syntax (C#)
```csharp
public static FailureDefinitionId BarsTooCloseNumber { get; }
```